export default {
  header: {
    name: 'Александр Пешков',
    links: ['Обо мне', 'Стек', 'Контрибьюты', 'Проекты', 'Конференции'],
  },
  about: {
    hello: 'Привет, я Александр',
    messages: ['Я frontend-разработчик', 'Активный контрибьютор в экосистему Vue.js', 'Люблю работать с Vue и Nuxt'],
    description: 'Я frontend-разработчик. Специализируюсь на создании современных и адаптивных пользовательских интерфейсов. Контрибьютор во',
    community: 'сообщество',
  },
  stack: 'Стек технологий',
  projects: {
    title: 'Проекты',
    description: 'Следующие проекты демонстрируют мои навыки и опыт на реальных примерах моей работы. Каждый проект кратко описан с ссылками на репозитории кода и живые демо-версии и сайты.',
    items: [
      { title: 'Notium — облачное приложение для создания и хранения заметок со встроенным AI' },
      { title: 'Jenda — ☁️ приложение для совместного и личного управления проектами и задачами' },
      { title: 'Интернет-магазин для продажи электрических самокатов Kugoo-Russia' },
      { title: 'Xpiler - это редактор кода для ваших идей и задач со встроенным AI' },
      { title: 'Boardify — виртуальная доска для совместной работы' },
      { title: 'Веб-сервис с AI, который помогает автоматизировать ключевые этапы подбора рекрутеров' },
      { title: 'AgileFusion - разработка идеальной agile-системы для МИРЭА' },
      { title: 'Сервис, использующий AI для помощи студентам колледжа при адаптации' },
      { title: 'Моя конфигурация Prettier — mnenie/prettier для (.js, .ts, .vue, .jsx, .tsx)' },
      { title: 'Pinia сниппеты для Visual Studio Code' },
      { title: 'Vortex UI — набор компонентов для Vue 3 + Tailwind' },
      { title: 'Автоматизированный сервис распределения задач для сотрудников Совкомбанка' },
      { title: 'Портал преподавателей — многостраничный сайт на Vue для поиска репетиторов и учеников' },
    ],
  },
  сontributions: {
    title: 'Контрибьюты',
    description: 'Этот раздел посвящен моему вкладу в сообщество Vue.js и его экосистему. Все, что вы можете увидеть, было официально выпущено или находится в режиме разработки. Этим пользуются многие люди по всему миру!',
  },
  talks: {
    title: 'Конференции',
    description: 'Этот раздел о моих выступлениях на конференциях в роли спикера.',
  },
}
